Test/Jerome_Test/Framework/IIS/xml/04-1_srr_getNextRequest.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:it="http://www.tmforum.org/mtop/fmw/xsd/mepit/v1" xmlns:m1="http://www.tmforum.org/mtossj/ws/aservice" xmlns:wsa="http://www.w3.org/2005/08/addressing" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/ http://www.tmforum.org/mtop/fmw/xsd/mepit/v1 ../xsd/MepIteratorDefinitionsV1-0.xsd">
  <SOAP-ENV:Header>
    <wsa:To>http://host:port/iterator/sp</wsa:To>
    <wsa:Action>http://www.tmforum.org/mtop/fmw/wsdl/it/v1-0/getNextRequest</wsa:Action>
  </SOAP-ENV:Header>
  <SOAP-ENV:Body>
    <it:getNextRequest>
      <it:iteratorId>123456</it:iteratorId>
    </it:getNextRequest>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
